<?php

/**
 *
 * @copyright  2010-2026 izend.org
 * @version    3
 * @link       http://www.izend.org
 */

function strflat($s) {
	$from = array(
				'à', 'â', 'ä', 'á', 'ã', 'å',
				'î', 'ï', 'ì', 'í',
				'ô', 'ö', 'ò', 'ó', 'õ', 'ø',
				'ù', 'û', 'ü', 'ú',
				'é', 'è', 'ê', 'ë',
				'ç', 'ñ',
				'æ', 'œ',
				'ð', 'đ', 'ł',
				'À', 'Â', 'Ä', 'Á', 'Ã', 'Å',
				'Î', 'Ï', 'Ì', 'Í',
				'Ô', 'Ö', 'Ò', 'Ó', 'Õ', 'Ø',
				'Ù', 'Û', 'Ü', 'Ú',
				'É', 'È', 'Ê', 'Ë',
				'Ç', 'Ñ',
				'Æ', 'Œ',
				'Ð', 'Đ', 'Ł',
	);

	$to = array(
				'a', 'a', 'a', 'a', 'a', 'a',
				'i', 'i', 'i', 'i',
				'o', 'o', 'o', 'o', 'o', 'o',
				'u', 'u', 'u', 'u',
				'e', 'e', 'e', 'e',
				'c', 'n',
				'ae', 'oe',
				'd', 'd', 'l',
				'A', 'A', 'A', 'A', 'A', 'A',
				'I', 'I', 'I', 'I',
				'O', 'O', 'O', 'O', 'O', 'O',
				'U', 'U', 'U', 'U',
				'E', 'E', 'E', 'E',
				'C', 'N',
				'AE', 'OE',
				'D', 'D', 'L',
	);

	return str_replace($from, $to, $s);
}
